{
  "timestamps": [
    {
      "time": 1,
      "text": "JAMES: Hello, I’m James Royal-Lawson.",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 4,
      "text": "JAMES: And this is UX Podcast. We’re in Stockholm, Sweden and you’re listening in 184 countries from Zambia to Portugal.",
      "back": ""
    },
    {
      "time": 12,
      "text": "PER: Jessica Ivins, UX designer, speaker, teacher and learner. She works at Center Centre, the UX Design School in Chattanooga, Tennessee founded by Jared Spool and Leslie Jensen-Inman.",
      "back": ""
    },
    {
      "time": 24,
      "text": "JAMES: Jess is someone we’ve referenced in a number of shows and even featured one of her articles in episode 190.",
      "back": ""
    },
    {
      "time": 34,
      "text": "PER: Right. And the article we featured in that link show was how to maintain a professional network throughout your UX career. And that together with a number of articles Jessica has written laid the seeds, which brings us to bringing her on the show for a chat today.",
      "back": ""
    },
    {
      "time": 48,
      "text": "JAMES: And the topic will be Getting Your Next UX Job.",
      "back": ""
    },
    {
      "time": 52,
      "text": "[music playing]",
      "back": "[music playing]"
    },
    {
      "time": 56,
      "text": "JAMES: I think all three of us get quite a lot of questions and enquiries from people asking for tips about how they should get going in UX or get a job in UX, or even get consulting gigs in UX. What kind of questions do you get, Jessica?",
      "back": ""
    },
    {
      "time": 79,
      "text": "JESSICA: Yeah, so I got all sorts of questions about this particularly because as you know, I’m an educator, I’m a faculty member at Center Centre or the UX Design School and our goal is to prepare our students to be industry-ready UX designers and get them jobs at graduation. So this is very, very top of mind for me. Like the whole job searching journey from the very, very beginning to when you’re actually in your new job. One of the things I really enjoy talking about with people, and I’ve written about this before, is planning for your next job search well before you’re actually searching for a job. So thinking ahead of time about how to put yourself out there, how to be known, how you want to be seen in the field so that if heaven forbid you were to get laid off or lose your job, you’ve already done a lot of the legwork and people know who you are and it’s much more easy for you at that point to get interviews and to get job leads than if you wait until you’re ready to look for a job and then start from scratch.",
      "back": ""
    },
    {
      "time": 142,
      "text": "PER: I really liked that approach because it’s just so much easier to prepare when you don’t have any pressure. ",
      "back": ""
    },
    {
      "time": 147,
      "text": "JESSICA: Yeah. I like to compare it to saving for retirement because at least here in the United States – I know you have listeners all over the world, but here in the United States, it’s up to you for the most part to save money for your retirement so that when you stop working you can still pay your bills. You hear in America all the time, “Don’t wait too long to save for retirement. Don’t wait until you’re getting close to retirement to save. Start saving early.” And I like to apply that thinking to getting a job. Start putting yourself out there ahead of time. Start thinking about what type of job you would want next if you were to lose your job and you had to get a new job and how do you present yourself as that type of designer to the industry?",
      "back": ""
    },
    {
      "time": 189,
      "text": "JAMES: So basically you’ve got to invest something every week or something in how you would maintain yourself.",
      "back": ""
    },
    {
      "time": 199,
      "text": "JESSICA: Yeah, exactly. It’s really small investments. That’s what I tell people. And it could be weekly, it could be biweekly. I recommend no less than biweekly because the things that you do regularly and the things that you schedule are the things that get done. So if you schedule something once a month, chances are you’re just not going to get to it. Because if it’s this once a month thing, you don’t have a habit around it. But if you’re doing it once a week, chances are you’ll probably get to it once a week. And if you don’t get to it every week, you’re probably going to get to it every other week. And at that point it’ll get done. And it could be as simple as 20 minutes a week. And it could be as complex as hours and hours every week. There’s no limit as to how much time and energy you want to put into it. I put a lot into it. I’m also in a position where I don’t have children and I don’t have any other sort of obligation outside of work that takes up my time so I can put a lot of time into it. But you don’t have to put a ton of time into it. Like I wrote an article talking about everything that I do to put myself out there as a UX designer. And I said several times throughout the article, you don’t have to do everything that I do. You don’t have to put hours. I probably put at least three hours outside of work time every week into building what I call my UX brands. But you don’t have to do that. It could be something like 20 minutes a week. Just really simple things to get yourself out there and to put in that legwork ahead of time.",
      "back": ""
    },
    {
      "time": 281,
      "text": "PER: Something I’ve seen you doing, I think, is actually tweet links to the same articles over a period of time, which to me seems like a hugely efficient way of doing it. You have these articles that are really good, we featured some of them on the show before. Just repurposing and reusing content is something that we’ve talked about in other contexts within the show as well. Thinking about doing that for yourself, it’s just up talk about saving time.",
      "back": ""
    },
    {
      "time": 2,
      "text": "JESSICA: Yes, and that’s a big social media marketing strategy. We’re small here at Central Centre, so I chip in to all sorts of things. Especially right now since we’re in between student cohorts and we don’t have students enrolled, I help out with things like social media. Social media marketers will tell you that it’s okay to take a resource that you want to share with your audience and share it multiple times and share it in different ways. So you might have a great UX article that you want to share and you can pull several different quotes from that article and then set up tweets to go out to that article. You can even reuse some of the same tweets or LinkedIn posts after – I don’t know so much about LinkedIn, but with Twitter, Twitter is so fleeting. People, even when they follow you, they’re not going to see everything that you tweet. If you tweet the same link two weeks later, chances are different people are going to see it. I once heard the analogy with Twitter that being on Twitter is like attending a cocktail party. Like there’s a big room full of people and at any given point you’re with one group of people hearing one conversation. But there are lots of conversations happening. So there’s no way that just because you’re in the room that you’re going to hear all the conversations. In that sense, I think it’s okay to repeat yourself and like you were saying, it’s just a great use of time and reuse of resources.",
      "back": ""
    },
    {
      "time": 2,
      "text": "JAMES: I know that’s something that both Per and I have got a lot of thoughts about is the whole thing with portfolios. What do you say to Center Centre students when it comes to creating a portfolio as a UX designer?",
      "back": ""
    },
    {
      "time": 2,
      "text": "JESSICA: Great question. Along the lines of what we were just talking about, one of the things that we work on with our students is making sure that they get started on their portfolio right away. We have a two year program as I mentioned, what we don’t recommend and we actually designed the programs, so this doesn’t happen is we don’t recommend that you wait until a year and a half into the program to start thinking about your portfolio. We teach our students to capture project. work from the very beginning and create what some people call a project diary. So that as you go through projects you are capturing the work that you’re doing. You’re taking screenshots of your designs, you’re taking photos of you working with other people, you’re taking photos of sticky notes on the wall. You are taking notes about the actual work that you’ve done. And you’re capturing the actual work and you’re logging it as you go. And it’s really easy to do that on a regular basis. It only takes a few minutes a day, right? And as long as you put it into some sort of trusted system, whether that’s Dropbox or a Google doc or however you choose to organize it, as long as it’s in some sort of organized system where you can go back and find the material, you have all that material ready. With our students over the course of two years, they have all this material saved up and they’ve taken notes so that when they go back and look at what they did a year and a half ago, they have all the materials in an organized system. They have notes about what they did so they can remember what they did. They use all that raw material to craft their portfolio. It makes the portfolio creation process so much easier because as you both probably know, the last thing you want to do is sit down and try to remember something you did a year and a half ago so that you can put it in your portfolio. You’re not going to remember most of what you did and you’re going to have a really hard time struggling to find the materials that you need.",
      "back": ""
    },
    {
      "time": 2,
      "text": "JAMES: I think Jared Spool has mentioned the design log when we’ve talked to him previously. And I think I said it’s a really good idea because I mean I don’t jump like the idea of the classic portfolio with lots of pretty pictures. Because we’ve seen the problem we have in the UX field is the final pretty design, isn’t really what we work with, but of course it’s been something that employers have of looked for over the years. They’re looking for graphic designer, all that kind of graphical design aspects during interview processes in many occasions. That makes me scared of a classic portfolio.",
      "back": ""
    },
    {
      "time": 2,
      "text": "JESSICA: Yeah, I agree. I mean the portfolio really the stories in your portfolio are really about the journey that you took and how you went through the project and how you got over the hurdles of the project and how you produce the best design possible within the constraints that you have. That’s really a story that’s not the end result, right? That’s not like, “Oh, here’s a screenshot of what we launched.” That’s not really telling the hiring manager what you can do. Really the hiring manager wants to see a story they want to see what was the problem that you had to deal with in this project? How did you and your team deal with this problem? What was your role on the team? How did you divvy up work and what was the context of your work? What did you do and what problems did you hit? How did you overcome those problems? And what did you release as a result? That’s really the classic story. You can plot that into a story arc. That’s what we teach our students is because we as human beings are wired to hear stories. We don’t like reading boring lists or think of like, I joke with my students that you don’t want to sound like Ben Stein reading and shopping list, right? You don’t want to sound like this monotone, “And then we did this and then we did this and then we did this.” Because that’s boring. Whether you’re actually telling a hiring manager a story in an interview or you’re writing a story for your portfolio, you want it to be engaging, you want to even get Hollywood about it. Be like, “Okay, we thought we had it all figured out and then this happened. Then the deadline moved and we had a week less. This is what we did. And then somebody got sick and they were supposed to do the usability testing and then they got really sick and had to go into the hospital. We had to scramble because we had participants coming in and here’s how we pulled that off.” Like hiring managers love that. First of all you’re and you’re tapping into the human brain that loves story and you are showing evidence of what you can do to the hiring manager in a really engaging way, excuse me, what you can do for the hiring manager in a really engaging way.",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: I think this is a hugely important point because I, I was actually doing portfolio reviews at an event recently and it was a lot of pretty pictures but I stood there talking to them and I was asking about the pictures and I was hearing you fantastic stories about how they came up with them and why. And this woman who had epilepsy, who had built an app for people with epilepsy. And it was hugely interesting. And I basically had one question for all of the people I talked to, “Why didn’t you put that story in your portfolio?” And they were like, “Oh, I didn’t think about that.” And the more people realize this, the more happy they will be with the jobs they get because of course the danger and huge risk here is that if you have a lot of you have are pictures, this is what you’ll get hired on and what you’ll be expected to be performing on and not all the work and the storytelling that was part of that project.",
      "back": ""
    },
    {
      "time": 2,
      "text": "JESSICA: Yeah, I remember there was a woman who contacted me and asked to video chat with me for guidance on her portfolio. This was about a year ago, so I met with her and we went through her portfolio together and she had this portfolio piece about these wireframes that she had created. Now she was kind of a career shift or she was doing some UX design at her job, but she was trying to move on to a fulltime UX job. I’m looking at that at her portfolio piece and she basically says, “Here are the wireframes I created. Here are the tools that I use to create them and here’s the project.” But that to me wasn’t the interesting part. When I asked her to tell me more about these wire frames, she said, “We were sitting around in a meeting trying to figure out how to work on this design and nobody knew what to do. I stepped up and suggested that, “Hey, why don’t we make some wireframes? I think this will help us.” And everybody was like, okay, let’s go ahead and try that.”  She went ahead and made the wireframes, show them to the team, got input, and then they agreed that they would move forward with part of her design and it really kicked the project forward. I told her, I’m like, that’s the story that as a hiring manager that I want to hear, that you stepped up, you saw a problem and you saw everybody else spinning wheels in a meeting, not knowing what to do and you suggested a tool and that’s tool move the project forward. That’s way bigger than, “Hey, here’s some wire frames I made.”",
      "back": ""
    },
    {
      "time": 2,
      "text": "JAMES: Maybe the fact that we said portfolio so much is in itself the problem. Part of the problem. I love the whole thing here and when we’re talking about career stories or project stories,  that kind of framing it as career stories feels much more exciting for me. I kind of, I’m getting interested just by hearing the title rather than getting worried about, Oh God, we’re just going to see in a one-dimensional pictures in a portfolio. I’m thinking as well about how if you go into an interview situation, talking about these stories, it becomes so much easier perhaps when you’ve already prepared the stories. It’s like having a half ready script in your collection instead of just a flat picture.",
      "back": ""
    },
    {
      "time": 2,
      "text": "JESSICA: Yeah. We talk with our students all the time about having stories on the ready. Stories that you can tell at networking events about the work that you’re producing, going back to what I was saying earlier, and putting yourself out there as a designer, because human beings we’re wired hear stories like I said. If you’re at a UX networking event and people ask you, what are you working on right now? If you have some really engaging stories that you’ve even practiced and rehearsed and that you can share, it’ll come off really strong. Whether you’re preparing for an interview or you’re preparing to go out to a networking event, story is huge and if you can tell a great story that shows evidence of the work you can do, it really makes you shine as a designer.",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: How do you start building your network? Because that’s a question I get a lot. Because I pick us, we have all these thoughts around, so keep working on your social media presence. Keep being out there, but what if I don’t have that many followers? What if I don’t have that many people in my network? Where do I start and how do I approach people without coming across us to needy?",
      "back": ""
    },
    {
      "time": 2,
      "text": "JESSICA: Yeah. I think part of it is just one step at a time. Like we all had to start somewhere, right? Like, I think I have about 7,500 followers on Twitter right now, which is a decent amount of followers, but I had to start from zero and I didn’t join Twitter until a little bit later than everybody else did. I think I joined in 2008 and everybody else had joined kind of late 2006, 2007 whenever it first started.",
      "back": ""
    },
    {
      "time": 2,
      "text": "JAMES: I joined 2009 that was after you.",
      "back": "[Laughter]"
    },
    {
      "time": 2,
      "text": "JESSICA: I’m glad I beat it to it. I think it’s just really one step at a time. Also, some of the best guidance that I’ve heard about networking is going into it with the mindset of how can I help other people? Basically putting deposits into the bank account before you make a withdrawal. What I don’t recommend is going to a UX networking event and just start promoting yourself and talking about yourself and trying to get things from people right away. You want to kind of build that relationship first. It could be as simple as introducing yourself and asking the person questions about them, like, “Oh, so where do you work? So you’re a UX researcher at this company? What type of projects are you working on right now?” Most people really enjoy talking about themselves and most people really appreciate it when you genuinely listen. That’s what I recommend is when you’re building a network, which could just be one person at a time. Like you could set a goal like, I’m going to this UX event tonight. My goal is to meet one person and have a meaningful conversation with them and listen to what they’re working on. And if you do that, chances are that person’s really going to appreciate you and remember you and maybe even help you later.",
      "back": "[Laughter]"
    },
    {
      "time": 2,
      "text": "PER: That’s really good advice because I think it’s for some people just getting out there for the first time and seeing all these people around you that have these many followers and you think it’s just too daunting of a task to get on with, but it is always for everyone one step at a time.",
      "back": ""
    },
    {
      "time": 2,
      "text": "JESSICA: Oh yeah, of course. Yeah. I set little goals. I even still do that today. Like, here in Chattanooga tomorrow I’m probably going to go to a local technology event and I usually set a goal to introduce myself to one person I don’t know, and just talk with him for a little while and ask them about themselves. I usually try to get their card and send them a LinkedIn request afterwards. It’s just like one simple goal and that doesn’t even take my whole night. I might be there for an hour and a half. It could take me 20 minutes to do that and then I can spend the rest of the night doing whatever else I want because I met because I met my goals.",
      "back": ""
    },
    {
      "time": 2,
      "text": "JAMES: What if you’re all quite active in social media and well write articles and record podcasts. But what if you’re someone who works like full time, you’re really busy, maybe you don’t work in one of the biggest cities, so there’s no kind of like tech meetups or UX meetups. What can we say for those people who aren’t maybe as forward and as out there as many the rest of us?",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    },
    {
      "time": 2,
      "text": "PER: And I’m Per Axbom",
      "back": ""
    }
  ]
}
